[{"title":"口译练习笔记","date":"2016-12-09T06:37:20.000Z","path":"2016/12/09/练习使用新主题/","text":"前天的口译练习材料是J.K. Rowling在哈佛大学的演讲。因为对Harry Potter系列不太熟悉，就翻墙去搜了点资料。恰好看到Harvard的官网上也有这段视频，比我们一般看到的版本长3分钟左右 - 多了主持人对J.K. Rowling的介绍。 主持人对J.K. Rowling的介绍第一遍听，发现很多似懂非懂的部分，大概知道为了请出J.K. Rowling，主持人讲了下去年、今年围绕Harry Potter有些什么活动，然后又概括了她文学方面的主要成就，以及在慈善方面的成就。但是中间有很多的细节，比如演讲所在的这个厅叫什么名字，J.K. Rowling成立的基金叫什么名字等等不是非常确定。 于是我想着，听写出这段话，说不定能更好的理解J.K. Rowling的演讲。原文听写内容如下： Last summer, in a grand celebration of literature, Harvard Square and Harvard Yard, historically known as THEPLACE for hollowed halls filled with books, was transformed to Hogwarts Square. This summer festival celebrated the midnight release of Harry Potter and the Deathly Hallows - the seventh and final installment in the wildly popular series. Hordes of people, children and adults alike, dressed in elaborate wizard costumes, stood in line for hours at the Coop to purchase copies of the book. Dozens of restaurants and stores stayed open late and posted Harry Potter - Theme specials. And a three-hour concert captured of the evening in the pact Tercentenary Theater. Today Tercentenary Theater is once again pact with children and adults. And we are pleased to welcome one of the most successful authors of our time. Her books have set sales records, and had won many awards. Probably because the Harry Potter stories provide a familiar backup for readers who can empathize with the young protagonist, a drift, in a sometimes cruel and challenging world. In addition to her vast contributions to literature. She is also noted for the social, moral and political inspiration she is giving to her fans. A notable philanthropist, she has established the Volant Charitable Trust, which donates millions of dollars to aid women and children and to combat poverty and social inequality. The fund also gives to organizations that aid children, one-parent families, and multiple sclerosis research. She herself has noted that a person has a moral responsibility when you be given far more than you need to do wise things with it and to give intelligently. And now I give you Ms. J.K. Rowling. 不确定的地方搜索整理： Harvard Square and Harvard Yard, historically known as THEPLACE for hollowed halls filled with books, was transformed to Hogwarts Square. 这句话，我在Harvard Square 的网页上找到了出处。 Tercentenary Theater听的时候不知道具体是什么名字，就搜了下Harry Potter and the Deathly Hallows，没想到，居然直接找到这段话（原文请点击这里查看）。 Volant Charitable Trust 介绍中的这段话可以在维基百科关于J.K. Rowling的介绍中看到。 J.K. Rowling的演讲全文及视频链接：http://news.harvard.edu/gazette/story/2008/06/text-of-j-k-rowling-speech/","tags":[{"name":"口译","slug":"口译","permalink":"http://yoursite.com/tags/口译/"},{"name":"践行","slug":"践行","permalink":"http://yoursite.com/tags/践行/"}]},{"title":"高效使用Google找到你要的结果","date":"2016-12-09T02:20:50.000Z","path":"2016/12/09/高效使用Google找到你要的结果/","text":"最近一再听到一个概念“高效使用Google”，于是有了深入了解搜索方法的想法。 先在Google里输入How to use Google effectively 得到大量的网页信息。比对后找到了Google Search Help接着想到李笑来blog里提到的其中一个关键词 ‘tutorial’，又用Google Search Tutorial搜索找到了Google Search Education比较了下两个网站上的内容，决定先从Google Search Help入手快速掌握一些实用技能，然后再回头学习Google Search Education怎么更优化搜索结果。 Search operators 使用Search operators的时候，中间不要用空格 “” 用引号标记搜索内容时，搜索结果只会显示包含与引号中完全一样的内容的信息。 $ 用来搜索价格 Example: nikon $400 .. 用两个句号（没有空格）分隔两个区间，能显示包含在这个区间内的结果。Example: camera $50..$100 也可以直接在Google高级搜索页面设置筛选结果。 搜索可以免费使用的图片使用权利类型： Free to use or share:在保持内容不改动的情况下，允许复制或重新发布。 Free to use, share, or modify Commercially 可以使用高级图片搜索筛选结果 本来想搜个图，让内容看起来更舒服些，注意力就被图中出现的干扰因素带跑了，还去看了看认知心理学和认知科学的相关内容。真是一不留神就跑偏了。 顺手找到个美国心理协会的网站：http://www.apa.org/index.aspx","tags":[{"name":"学习","slug":"学习","permalink":"http://yoursite.com/tags/学习/"},{"name":"Google","slug":"Google","permalink":"http://yoursite.com/tags/Google/"}]},{"title":"翻译练习笔记 -Day 1","date":"2016-11-26T13:12:01.000Z","path":"2016/11/26/翻译练习笔记/","text":"弗朗西斯·福山 ： Foreign Affairs :Foreign Affairs is an American magazine of international relations and U.S. foreign policy published by the Council on Foreign Relations, a nonprofit, nonpartisan, membership organization and think tank specializing in U.S. foreign policy and international affairs.[1] Founded in 1922, the print magazine is currently published every two months, while the website publishes articles daily. a system of “checks and balances” :权衡制度 partisan polarization党派两级分化 vetocracy ：否决政治，A vetocracy refers to a dysfunctional system of governance whereby no single entity can acquire enough power to make decisions and take effective charge. hall­marks of ：a typical characteristic or feature of a person or thing on the sarface : at first glance bear out : to support the truth of something hostile takeover :The key characteristic of a hostile takeover is that the target company’s management does not want the deal to go through. ultra-insider：网上没搜到对应的中文意思，暂时想到“老司机” self-dealing :假公济私 the Establishment ：既有体制","tags":[{"name":"英语","slug":"英语","permalink":"http://yoursite.com/tags/英语/"}]},{"title":"在使用中学习Marddown语法","date":"2016-11-21T04:35:38.000Z","path":"2016/11/21/Markdown语法学习笔记/","text":"1.加超链接Here’s [a link to something else][another place]. Here’s [yet another link][another-link]. And now back to [the first link][another place]. [another place]: www.github.com [another-link]: www.google.com 2.插入图片（在正文中显示图片） 感叹号![描述文字] (图片链接) 添加描述文字时，在!前加[描述性文字] 3.引用引入大断文字需要土分行时，只需在空行处加一个&gt; 4.项目符号 (无顺序）用单个星号*，后面有空格 (有顺序）用数字后加点空格 多级序列 用*缩进 Tintin A reporter Has poofy orange hair Friends with the world’s most awesome dog Haddock A sea captain Has a fantastic beard Loves whiskey Possibly also scotch? 5.换行 按两次回车换行（中间会生成一行空格） 句末插入2个空格—soft breaks （貌似是Git上的语法，在MarkdwonPad和MacDown上都显示不正确。 ） 12/9/2016 11:24:26 AM对上一条修改为：句末插入2个空格，再按回车——softbreaks 6.还想掌握的 本地图片怎么才可以传到我的博客上？ 12/9/2016 11:25:21 AM tags如何能识别多个标签？12/9/2016 12:14:37 PM 换了多个关键词，最后用multiple tags在GitHub上找到了回答。然后循着找到了Front-matter|Hexo之前搜索的时候，我就来到过这个页面，但是答案摆在那里，我就是没看到！！！根本没意识到，这就是解决我要的问题的办法。","tags":[{"name":"GitHub","slug":"GitHub","permalink":"http://yoursite.com/tags/GitHub/"},{"name":"学习","slug":"学习","permalink":"http://yoursite.com/tags/学习/"}]},{"title":"Hexo重点操作","date":"2016-11-18T06:57:47.000Z","path":"2016/11/18/我的第一篇博客/","text":"跟着操作指南一步步完成，虽然中间遇到不少小问题，但总体来说我的动手能力还不错（应该是模仿能力），终于新手建起自己的第一个博客啦。整理一些平常Git Shell中会用到的命令： cd / 返回根目录 cd hexo 进入hexo文件夹 在 c:/hexo界面下： hexo clean 清除 hexo g -d 生成并在网页上布署deploy hexo new page “页面名称” 新建 文件夹 hexo new “文章题目” 新建文章 hexo s (server 生成预览页面）","tags":[{"name":"GitHub","slug":"GitHub","permalink":"http://yoursite.com/tags/GitHub/"},{"name":"学习","slug":"学习","permalink":"http://yoursite.com/tags/学习/"}]},{"title":"Hello World","date":"2016-11-17T08:35:38.000Z","path":"2016/11/17/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]